Repository: Gaoyifei1011/GetStoreApp
Catalog: GetStoreApp/Strings/*/Settings.resw
Source language: en_us
Languages: ar, zh_hans

# Advanced
source: Advanced Options
ar: خيارات متقدمة
zh_hans: 高级选项

source: Always show backdrop
ar: عرض الخلفية دائمًا
zh_hans: 始终显示背景色

# AlwaysShowBackdropDescription
source: The window does not fall back to a solid color when it loses focus
ar: لا يتراجع النافذة إلى لون صلب عندما تفقد التركيز
zh_hans: 窗口失去焦点时不会回退为纯色

# AlwaysShowBackdropOffContent
source: Closed
ar: مغلق
zh_hans: 关闭

# AlwaysShowBackdropOnContent
source: Opened
ar: مفتوح
zh_hans: 开启

# AppCacheFolder
source: App cache
zh_hans: 应用缓存

source: Appearance
ar: المظهر
zh_hans: 外观

# AppInstall
source: Install using the app installer
ar: التثبيت باستخدام مثبت التطبيق
zh_hans: 使用应用安装程序安装

# Backdrop
source: Window background material
ar: مادة خلفية النافذة
zh_hans: 窗口背景材质

# BackdropAcrylic
source: Default
zh_hans: 默认

# BackdropDefault
source: None
ar: لا شيء
zh_hans: 不开启

# BackdropDescription
source: Sets the background color of the app's rendering
ar: يحدد لون الخلفية لعرض التطبيق
zh_hans: 设置应用呈现的背景色

# BackdropMica
source: Default
zh_hans: 默认

# BlockMap
source: Files with file name extensions called BlockMap are not displayed
ar: الملفات ذات امتدادات أسماء الملفات المسماة BlockMap لا تظهر
zh_hans: 不显示文件扩展名称为BlockMap的文件

# BlockMapDescription
source: BlockMap files are created automatically by makeappx.exe when they are packaged
zh_hans: BlockMap文件由makeappx.exe打包时自动创建

# BlockMapOffContent
source: Do not filter
ar: لا تقم بالتصفية
zh_hans: 不过滤

# BlockMapOnContent
source: filter
ar: تصفية
zh_hans: 过滤

# ChangeFolder
source: Change directory
ar: تغيير الدليل
zh_hans: 更改目录

source: Clear
zh_hans: 清除

# ClearLog
source: Clear log record
zh_hans: 清除日志记录

# ClearLogDescription
source: Clear all log contents of the app
zh_hans: 清除应用所有的日志内容

# CodeInstall
source: Direct installation
ar: التثبيت المباشر
zh_hans: 直接安装

source: Custom
zh_hans: 自定义

# DeliveryOptimization
source: Delivery optimization settings
zh_hans: 传递优化设置

# DeliveryOptimizationDescription
source: Open the system's delivery optimization Settings
zh_hans: 打开系统的传递优化设置

# DesktopAcrylic
source: Acrylic
zh_hans: 亚克力

# DesktopFolder
source: Desktop
zh_hans: 桌面

source: Dev version
ar: إصدار المطور
zh_hans: 开发版本

# DevVersionInstall
source: Install
ar: تثبيت
zh_hans: 安装

# DevVersionInstalled
source: Installed
ar: تم التثبيت
zh_hans: 已安装

# DevVersionInstallToolTip
source: Click to install the dev version
ar: انقر للتثبيت إصدار المطور
zh_hans: 点击安装开发版本

# DoEngineBits
source: BITS
zh_hans: 后台智能传输服务

# DoEngineDo
source: Delivery optimization
zh_hans: 传递优化

# DoEngineMode
source: Download engine mode
zh_hans: 下载引擎方式

# DoEngineModeDescription
source: Set the download engine to use when downloading files,this parameter takes effect after a restart
zh_hans: 设置下载文件时使用的下载引擎，重启后生效

# DownloadFolder
source: Downloads
zh_hans: 下载

# DownloadOptions
source: Download management
ar: إدارة التنزيلات
zh_hans: 下载管理

# DownloadOptionsDescription
source: Application download file settings
ar: إعدادات ملف تنزيل التطبيق
zh_hans: 应用程序下载文件设置

# EncryptedPackage
source: The encrypted package file is not displayed
zh_hans: 不显示加密包文件

# EncryptedPackageDescription
source: This type of file is an encrypted application package
zh_hans: 该类型文件是加密的应用程序包

# EncryptedPackageOffContent
source: Do not filter
zh_hans: 不过滤

# EncryptedPackageOnContent
source: filter
zh_hans: 过滤

source: File storage path
zh_hans: 文件存放路径

# General
source: General Options
ar: خيارات عامة
zh_hans: 常规选项

# InstallMode
source: Application install mode
ar: وضع تثبيت التطبيق
zh_hans: 应用安装方式

# InstallModeDescription
source: Select how the Windows app package is installed
ar: اختر كيفية تثبيت حزمة تطبيقات Windows
zh_hans: 选择Windows 应用包的安装方式

# InteractiveInstall
source: Install interactively
ar: تثبيت تفاعلي
zh_hans: 以交互方式安装

source: Language
ar: اللغة
zh_hans: 界面语言

# LanguageDescription
source: Modify the language displayed in the app interface
ar: تعديل اللغة المعروضة في واجهة التطبيق
zh_hans: 修改应用界面显示的语言

# LearnDoEngine
source: Download engine instruction
zh_hans: 下载引擎说明

# LinkFilter
source: Link filtering
ar: تصفية الروابط
zh_hans: 链接过滤

# LinkFilterDescription
source: Filter out links that you won't use to make finding apps more efficient
ar: تصفية الروابط التي لن تستخدمها لجعل العثور على التطبيقات أكثر كفاءة
zh_hans: 过滤掉不会使用的链接，提升查找应用的效率

# LogFolder
source: Log storage path
zh_hans: 日志存放路径

# LogFolderDescription
source: Manage the log content of the app
zh_hans: 管理应用的日志内容

source: Log record
zh_hans: 日志记录

# LogRecordDescription
source: Manage app log record
zh_hans: 管理应用日志记录

source: Mica
zh_hans: 云母

# Notification
source: App notifications
ar: إشعارات التطبيق
zh_hans: 应用通知

# NotificationDescription
source: Displays message notifications from the app
ar: يعرض إشعارات الرسائل من التطبيق
zh_hans: 显示来自应用的消息通知

# NotificationOffContent
source: Closed
ar: مغلق
zh_hans: 关闭

# NotificationOnContent
source: Opening
ar: فتح
zh_hans: 开启

source: Official version
ar: الإصدار الرسمي
zh_hans: 官方版本

# OfficialVersionInstall
source: Install
ar: تثبيت
zh_hans: 安装

# OfficialVersionInstalled
source: Installed
ar: تم التثبيت
zh_hans: 已安装

# OfficialVersionInstallToolTip
source: Click to install the official version
ar: انقر لتثبيت الإصدار الرسمي
zh_hans: 点击安装官方版本

# OpenDeliveryOptimzationSettings
source: Open
zh_hans: 打开

# OpenFolderToolTip
source: Click to access the folder
ar: انقر للوصول إلى المجلد
zh_hans: 单击访问该文件夹

# OpenLogFolder
source: Open folder
zh_hans: 打开文件夹

# OpenWinGetSettings
source: Open
ar: فتح
zh_hans: 打开

# OpenWinGetSettingsToolTip
source: Open configuration file
ar: فتح ملف التكوين
zh_hans: 打开配置文件

source: Query links mode
zh_hans: 查询链接方式

# QueryLinksModeDescription
source: Select the application interface channel to query the link
zh_hans: 选择查询链接的应用接口渠道

# QueryLinksModeOfficial
source: Official interface
zh_hans: 官方接口

# QueryLinksModeThirdParty
source: Third party interface
zh_hans: 第三方接口

# RestartApp
source: Application restart
ar: إعادة تشغيل التطبيق
zh_hans: 重启应用

# RestartAppToolTip
source: After the app settings are modified, some options need to be restarted to take effect
ar: بعد تعديل إعدادات التطبيق، تحتاج بعض الخيارات إلى إعادة التشغيل لتأخذ تأثيرها
zh_hans: 应用设置发生修改后，部分选项需要重启后生效

source: Select folder
zh_hans: 选择文件夹

source: Settings instruction
zh_hans: 设置说明

# ShowVersion
source: Show
ar: عرض
zh_hans: 查看

# ShowVersionToolTip
source: View WinGet version information for the device
ar: عرض معلومات إصدار WinGet للجهاز
zh_hans: 查看该设备的 WinGet 具体版本信息

# SlientInstall
source: Install sliently
ar: تثبيت بصمت
zh_hans: 以静默方式安装

source: System backdrop settings
zh_hans: 系统背景色设置

source: System language settings
zh_hans: 系统语言设置

source: System notification settings
zh_hans: 系统通知设置

source: System theme settings
zh_hans: 系统主题设置

# Theme
source: Application theme
ar: ثيم التطبيق
zh_hans: 应用主题

# ThemeDark
source: Dark
ar: داكن
zh_hans: 深色

# ThemeDefault
source: Windows default
ar: افتراضي ويندوز
zh_hans: 使用系统设置

# ThemeDescription
source: Select the application theme to display
ar: اختر ثيم التطبيق للعرض
zh_hans: 选择要显示的应用主题

# ThemeLight
source: Light
ar: فاتح
zh_hans: 浅色

# Title
source: Settings
ar: الإعدادات
zh_hans: 设置

# TopMost
source: Window set on top
ar: النافذة مثبتة في الأعلى
zh_hans: 窗口置顶

# TopMostDescription
source: Places the currently applied window at the very top
ar: يضع النافذة الحالية في أعلى القائمة
zh_hans: 将当前应用的窗口置于最顶端

# TopMostOffContent
source: Not pinned
ar: غير مثبتة
zh_hans: 未置顶

# TopMostOnContent
source: Pinned
ar: مثبتة
zh_hans: 置顶

source: Trace cleanup
ar: تنظيف السجل
zh_hans: 痕迹清理

# TraceCleanupDescription
source: Clean up all traces of use within the app
ar: تنظيف جميع آثار الاستخدام داخل التطبيق
zh_hans: 清理应用内使用过的所有痕迹

# TraceClear
source: Select what you want to clean
ar: اختر ما تريد تنظيفه
zh_hans: 选择要清理的内容

# UseDevFirst
source: Priority use dev version
ar: تفضيل استخدام إصدار المطور أولاً
zh_hans: 优先使用开发版本

# UseDevFirstOffContent
source: No
ar: لا
zh_hans: 否

# UseDevFirstOnContent
source: Yes
ar: نعم
zh_hans: 是

# UseDevFirstToolTip
source: When both versions exist, the development version is preferred (takes effect after restart)
ar: عندما يوجد إصدارين، يُفضل إصدار التطوير (يأخذ تأثيره بعد إعادة التشغيل)
zh_hans: 当两个版本共同存在时，优先使用开发版本（重启后生效）

# WebKernel
source: Browser kernel selection
zh_hans: 浏览器内核选择

# WebKernelDescription
source: Select the kernel used by the web browser to render the page
zh_hans: 选择网页浏览器渲染页面使用的内核

# WinGetConfig
source: WinGet config options
ar: خيارات تكوين WinGet
zh_hans: WinGet 配置选项

# WinGetConfigDescription
source: Customize the WinGet package's function
ar: تخصيص وظيفة حزمة WinGet
zh_hans: 对 WinGet 程序包的功能进行自定义

source: WinGet install mode
ar: وضع تثبيت WinGet
zh_hans: WinGet 安装方式

# WinGetInstallModeDescription
source: Set how the WinGet package interacts when installing applications
ar: تعيين كيفية تفاعل حزمة WinGet عند تثبيت التطبيقات
zh_hans: 设置 WinGet 程序包安装应用时的交互方式

source: WinGet settings
ar: إعدادات WinGet
zh_hans: WinGet 设置

# WinGetSettingsDescription
source: Customizing the WinGet package's function
ar: تخصيص وظيفة حزمة WinGet
zh_hans: 自定义 WinGet 程序包的功能

source: WinGet version
ar: إصدار WinGet
zh_hans: WinGet 版本

# WinGetVersionDescription
source: Show the current version of the WinGet application
ar: عرض الإصدار الحالي من تطبيق WinGet
zh_hans: 查看 WinGet 应用的当前版本

source: Learn config
zh_hans: 了解配置

# ShellMenu
source: File right-click menu
zh_hans: 文件右键菜单

# ShellMenuDescription
source: Whether to display the file right-click menu in the system
zh_hans: 是否在系统中显示文件右键菜单

# ShellMenuOffContent
source: Hide
zh_hans: 隐藏

# ShellMenuOnContent
source: Show
zh_hans: 显示

source: Restart explorer
zh_hans: 重启资源管理器

source: Download WebView2
zh_hans: 下载 WebView2

# UseSystemRegionOffContent
source: No
zh_hans: 否

# UseSystemRegionOnContent
source: Yes
zh_hans: 是

# UseSystemRegion
source: Use system country or region value
zh_hans: 使用系统国家或地区值

source: Current country or region:
zh_hans: 当前国家或区域：

# StoreCountryOrRegion
source: Country or region
zh_hans: 国家和地区

# StoreCountryOrRegionDescription
source: Set Microsoft Store countries and regions
zh_hans: 设置微软商店的国家或地区

source: System region settings
zh_hans: 系统区域设置

source: Store region
zh_hans: 商店区域

# StoreRegionDescription
source: Set the Microsoft Store market area
zh_hans: 设置微软商店市场区域

# BackdropAcrylic
source: Acrylic
ar: افتراضي

# BackdropMica
source: Mica
ar: افتراضي

# BackdropMicaAlt
source: Mica alt
ar: بديل

# BlockMapDescription
source: BlockMap files are created automatically by makeappx .exe when they are packaged
ar: تُنشأ ملفات BlockMap تلقائيًا بواسطة makeappx.exe عند تعبئتها

# DownloadFolder
source: File storage path
ar: التنزيلات

# SelectFolder
source: Please select the directory you want to save
ar: اختر المجلد
